In [190]:
import sqlite3 as sql
from datetime import datetime, timedelta
conn = sql.connect('Demo.db')
cursor = conn.cursor()

In [191]:
cursor.execute('''
Drop table student''')
cursor.execute('''
Drop table course''')
cursor.execute('''
create TABLE student (
    student_id INT PRIMARY Key,
    name VARCHAR(50),
    class VARCHAR(50),
    course_id INT,
    score DECIMAL
);''')
cursor.execute('''CREATE TABLE course(
    id INT PRIMARY KEY,
    course_name VARCHAR(50)
);''')
cursor.execute('''INSERT INTO student VALUES
    (1,'Nguyen Minh Hoang','May Tinh',12,6.7),
    (2,'Tran Thi Lan','Kinh Te',34,9.2),
    (3,'Pham Van Nam','Toan Tin',Null,7.9),
    (4,'Le Thanh Huyen','Toan Tin',20,7.2),
    (5,'Vu Quoc Anh','May Tinh',24,8.0),
    (6,'Dang Thuy Linh','May Tinh',24,5.5),
    (7,'Bui Tien Dung','Kinh Te',34,9.2),
    (8,'Ho Ngoc Mai','Toan Tin',20,8.8),
    (9,'Duong Huu Phuc','Kinh Te',Null,7.2),
    (10,'Cao Thi Hanh','May Tinh',Null,7.0);''')
cursor.execute('''INSERT INTO course VALUES
    (12,'Giai Tich'),
    (34,'Thong Ke'),
    (26,'Tin Hoc');
''')

In [192]:
conn.commit()

In [193]:
cursor.execute('''
SELECT * FROM student CROSS JOIN course''')
print("Kết quả của tích Decartes:")
for row in cursor.fetchall():
    print(row)

Kết quả của tích Decartes:
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 12, 'Giai Tich')
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 34, 'Thong Ke')
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 26, 'Tin Hoc')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 12, 'Giai Tich')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 34, 'Thong Ke')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 26, 'Tin Hoc')
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9, 12, 'Giai Tich')
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9, 34, 'Thong Ke')
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9, 26, 'Tin Hoc')
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, 12, 'Giai Tich')
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, 34, 'Thong Ke')
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, 26, 'Tin Hoc')
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8, 12, 'Giai Tich')
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8, 34, 'Thong Ke')
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8, 26, 'Tin Hoc')
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, 12, 'Giai Tich')
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, 34, 'Thong Ke')
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, 26, 'Tin Hoc')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 12, 'Giai Tich')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 34, 'Thong Ke')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 26, 'Tin Hoc')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, 12, 'Giai Tich')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, 34, 'Thong Ke')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, 26, 'Tin Hoc')
(9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, 12, 'Giai Tich')
(9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, 34, 'Thong Ke')
(9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, 26, 'Tin Hoc')
(10, 'Cao Thi Hanh', 'May Tinh', None, 7, 12, 'Giai Tich')
(10, 'Cao Thi Hanh', 'May Tinh', None, 7, 34, 'Thong Ke')
(10, 'Cao Thi Hanh', 'May Tinh', None, 7, 26, 'Tin Hoc')

In [194]:
cursor.execute('''
SELECT * FROM student
INNER JOIN course ON student.course_id = course.id''')
print("\nKết quả của INNER JOIN:")
for row in cursor.fetchall():
    print(row)

Kết quả của INNER JOIN:
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 12, 'Giai Tich')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 34, 'Thong Ke')
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 34, 'Thong Ke')

In [195]:
cursor.execute('''
SELECT * FROM student
LEFT JOIN course ON student.course_id = course.id''')
print("\nKết quả của LEFT JOIN:")
for row in cursor.fetchall():
    print(row)

Kết quả của LEFT JOIN:
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 12, 'Giai Tich')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 34, 'Thong Ke')
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9, None, None)
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, None, None)
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8, None, None)
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, None, None)
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 34, 'Thong Ke')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, None, None)
(9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, None, None)
(10, 'Cao Thi Hanh', 'May Tinh', None, 7, None, None)

In [196]:
cursor.execute('''
SELECT * FROM course
LEFT JOIN student ON student.course_id = course.id''')
print("\nKết quả của RIGHT JOIN:")
for row in cursor.fetchall():
    print(row)

Kết quả của RIGHT JOIN:
(12, 'Giai Tich', 1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7)
(34, 'Thong Ke', 2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2)
(34, 'Thong Ke', 7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2)
(26, 'Tin Hoc', None, None, None, None, None)

In [197]:
cursor.execute('''
SELECT * FROM student
LEFT JOIN course ON student.course_id = course.id
UNION
SELECT * FROM course
LEFT JOIN student ON student.course_id = course.id''')
print("\nKết quả của FULL OUTER JOIN:")
for row in cursor.fetchall():
    print(row)

Kết quả của FULL OUTER JOIN:
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 12, 'Giai Tich')
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 34, 'Thong Ke')
(3, 'Pham Van Nam', 'Toan Tin', None, 7.9, None, None)
(4, 'Le Thanh Huyen', 'Toan Tin', 20, 7.2, None, None)
(5, 'Vu Quoc Anh', 'May Tinh', 24, 8, None, None)
(6, 'Dang Thuy Linh', 'May Tinh', 24, 5.5, None, None)
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 34, 'Thong Ke')
(8, 'Ho Ngoc Mai', 'Toan Tin', 20, 8.8, None, None)
(9, 'Duong Huu Phuc', 'Kinh Te', None, 7.2, None, None)
(10, 'Cao Thi Hanh', 'May Tinh', None, 7, None, None)
(12, 'Giai Tich', 1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7)
(26, 'Tin Hoc', None, None, None, None, None)
(34, 'Thong Ke', 2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2)
(34, 'Thong Ke', 7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2)

In [198]:
cursor.execute('''
UPDATE student
SET course_id = 26
WHERE student.course_id IS NULL;
''')
cursor.execute('''
DELETE FROM student
WHERE course_id NOT IN (SELECT id FROM course);
''')
cursor.execute('''
select * from student''')
for row in cursor.fetchall():
    print(row)
conn.commit()

(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7)
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2)
(3, 'Pham Van Nam', 'Toan Tin', 26, 7.9)
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2)
(9, 'Duong Huu Phuc', 'Kinh Te', 26, 7.2)
(10, 'Cao Thi Hanh', 'May Tinh', 26, 7)

In [199]:
cursor.execute('''
SELECT class, COUNT(*) AS total_student, AVG(score) AS average_score
FROM student
GROUP BY class;''')
print("\nTổng số sinh viên và điểm trung bình của từng lớp:")
for row in cursor.fetchall():
    print(row)

Tổng số sinh viên và điểm trung bình của từng lớp:
('Kinh Te', 3, 8.533333333333333)
('May Tinh', 2, 6.85)
('Toan Tin', 1, 7.9)

In [200]:
cursor.execute('''
SELECT course_name, COUNT(*) AS total_student, AVG(score) AS average_score
FROM student
JOIN course ON student.course_id = course.id
GROUP BY course_name;''')
print("\nTổng số sinh viên và điểm trung bình của từng môn học:")
for row in cursor.fetchall():
    print(row)

Tổng số sinh viên và điểm trung bình của từng môn học:
('Giai Tich', 1, 6.7)
('Thong Ke', 2, 9.2)
('Tin Hoc', 3, 7.366666666666667)

In [201]:
cursor.execute('''
SELECT course_name, AVG(score) AS average_score,
CASE
    WHEN AVG(score) >= 9.0 THEN 'Xuất sắc'
    WHEN AVG(score) BETWEEN 6.0 AND 8.9 THEN 'Tốt'
    ELSE 'Kém'
END AS rank
FROM student
JOIN course ON student.course_id = course.id
GROUP BY course_name;''')
print("\nPhân loại thi đua theo số điểm của từng môn học:")
for row in cursor.fetchall():
    print(row)

Phân loại thi đua theo số điểm của từng môn học:
('Giai Tich', 6.7, 'Tốt')
('Thong Ke', 9.2, 'Xuất sắc')
('Tin Hoc', 7.366666666666667, 'Tốt')

In [202]:
cursor.execute('ALTER TABLE student ADD COLUMN overall_rank INTEGER')
cursor.execute('''
WITH Rankedstudent AS (
    SELECT student_id, score, 
    RANK() OVER (ORDER BY score DESC) AS rank
    FROM student
)
UPDATE student
SET overall_rank = (SELECT rank FROM Rankedstudent WHERE student.student_id = Rankedstudent.student_id)
''')
cursor.execute('''
SELECT student_id, name, score, overall_rank
FROM student
ORDER BY overall_rank ASC
LIMIT 3
''')
print("Top 3 sinh viên đạt thứ hạng cao nhất theo điểm số tổng thể:")
for row in cursor.fetchall():
    print(row)
cursor.execute('''
SELECT student_id, name, score, overall_rank
FROM student
ORDER BY overall_rank DESC
LIMIT 3
''')
print("\nTop 3 sinh viên đạt thứ hạng thấp nhất theo điểm số tổng thể:")
for row in cursor.fetchall():
    print(row)

Top 3 sinh viên đạt thứ hạng cao nhất theo điểm số tổng thể:
(2, 'Tran Thi Lan', 9.2, 1)
(7, 'Bui Tien Dung', 9.2, 1)
(3, 'Pham Van Nam', 7.9, 3)

Top 3 sinh viên đạt thứ hạng thấp nhất theo điểm số tổng thể:
(1, 'Nguyen Minh Hoang', 6.7, 6)
(10, 'Cao Thi Hanh', 7, 5)
(9, 'Duong Huu Phuc', 7.2, 4)

In [203]:
cursor.execute('ALTER TABLE student ADD COLUMN class_rank INTEGER')
cursor.execute('''
WITH Rankedstudent AS (
    SELECT student_id, class, score, 
    RANK() OVER (PARTITION BY class ORDER BY score DESC) AS rank
    FROM student
)
UPDATE student
SET class_rank = (SELECT rank FROM Rankedstudent WHERE student.student_id = Rankedstudent.student_id)
''')
cursor.execute('''
Select * from student''')
print("\nXếp hạng sinh viên theo điểm số trong từng lớp học:")
for row in cursor.fetchall():
    print(row)
cursor.execute('''
SELECT student_id, name, class, score, class_rank
FROM student
WHERE class_rank <= 3
ORDER BY class, class_rank ASC
''')
print("\nTop 3 sinh viên đạt thứ hạng cao nhất theo điểm số trong từng lớp học:")
for row in cursor.fetchall():
    print(row)
cursor.execute('''
SELECT student_id, name, class, score, class_rank
FROM student
WHERE class_rank >= (SELECT MAX(class_rank) FROM student WHERE class = student.class) - 2
ORDER BY class, class_rank DESC
''')
print("\nTop 3 sinh viên đạt thứ hạng thấp nhất theo điểm số trong từng lớp học:")
for row in cursor.fetchall():
    print(row)

Xếp hạng sinh viên theo điểm số trong từng lớp học:
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 6, 2)
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 1, 1)
(3, 'Pham Van Nam', 'Toan Tin', 26, 7.9, 3, 1)
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 1, 1)
(9, 'Duong Huu Phuc', 'Kinh Te', 26, 7.2, 4, 3)
(10, 'Cao Thi Hanh', 'May Tinh', 26, 7, 5, 1)

Top 3 sinh viên đạt thứ hạng cao nhất theo điểm số trong từng lớp học:
(2, 'Tran Thi Lan', 'Kinh Te', 9.2, 1)
(7, 'Bui Tien Dung', 'Kinh Te', 9.2, 1)
(9, 'Duong Huu Phuc', 'Kinh Te', 7.2, 3)
(10, 'Cao Thi Hanh', 'May Tinh', 7, 1)
(1, 'Nguyen Minh Hoang', 'May Tinh', 6.7, 2)
(3, 'Pham Van Nam', 'Toan Tin', 7.9, 1)

Top 3 sinh viên đạt thứ hạng thấp nhất theo điểm số trong từng lớp học:
(9, 'Duong Huu Phuc', 'Kinh Te', 7.2, 3)
(2, 'Tran Thi Lan', 'Kinh Te', 9.2, 1)
(7, 'Bui Tien Dung', 'Kinh Te', 9.2, 1)
(1, 'Nguyen Minh Hoang', 'May Tinh', 6.7, 2)
(10, 'Cao Thi Hanh', 'May Tinh', 7, 1)
(3, 'Pham Van Nam', 'Toan Tin', 7.9, 1)

In [204]:
cursor.execute('ALTER TABLE student ADD COLUMN course_rank INTEGER')
cursor.execute('''
WITH Rankedstudent AS (
    SELECT student_id, course_id, score, 
    RANK() OVER (PARTITION BY course_id ORDER BY score DESC) AS rank
    FROM student
)
UPDATE student
SET course_rank = (SELECT rank FROM Rankedstudent WHERE student.student_id = Rankedstudent.student_id)
''')
cursor.execute('''
select * from student''')
print("\nXếp hạng sinh viên theo điểm số trong từng môn học:")
for row in cursor.fetchall():
    print(row)
cursor.execute('''
SELECT student_id, name, course_id, score, course_rank
FROM student
WHERE course_rank <= 3
ORDER BY course_id, course_rank ASC
''')
print("\nTop 3 sinh viên đạt thứ hạng cao nhất theo điểm số trong từng môn học:")
for row in cursor.fetchall():
    print(row)
cursor.execute('''
SELECT student_id, name, course_id, score, course_rank
FROM student
WHERE course_rank >= (SELECT MAX(course_rank) FROM student WHERE course_id = student.course_id) - 2
ORDER BY course_id, course_rank DESC
''')
print("\nTop 3 sinh viên đạt thứ hạng thấp nhất theo điểm số trong từng môn học:")
for row in cursor.fetchall():
    print(row)

Xếp hạng sinh viên theo điểm số trong từng môn học:
(1, 'Nguyen Minh Hoang', 'May Tinh', 12, 6.7, 6, 2, 1)
(2, 'Tran Thi Lan', 'Kinh Te', 34, 9.2, 1, 1, 1)
(3, 'Pham Van Nam', 'Toan Tin', 26, 7.9, 3, 1, 1)
(7, 'Bui Tien Dung', 'Kinh Te', 34, 9.2, 1, 1, 1)
(9, 'Duong Huu Phuc', 'Kinh Te', 26, 7.2, 4, 3, 2)
(10, 'Cao Thi Hanh', 'May Tinh', 26, 7, 5, 1, 3)

Top 3 sinh viên đạt thứ hạng cao nhất theo điểm số trong từng môn học:
(1, 'Nguyen Minh Hoang', 12, 6.7, 1)
(3, 'Pham Van Nam', 26, 7.9, 1)
(9, 'Duong Huu Phuc', 26, 7.2, 2)
(10, 'Cao Thi Hanh', 26, 7, 3)
(2, 'Tran Thi Lan', 34, 9.2, 1)
(7, 'Bui Tien Dung', 34, 9.2, 1)

Top 3 sinh viên đạt thứ hạng thấp nhất theo điểm số trong từng môn học:
(1, 'Nguyen Minh Hoang', 12, 6.7, 1)
(10, 'Cao Thi Hanh', 26, 7, 3)
(9, 'Duong Huu Phuc', 26, 7.2, 2)
(3, 'Pham Van Nam', 26, 7.9, 1)
(2, 'Tran Thi Lan', 34, 9.2, 1)
(7, 'Bui Tien Dung', 34, 9.2, 1)

In [205]:
cursor.execute('''
ALTER TABLE student ADD COLUMN graduation_date DATETIME
''')
cursor.execute('''
SELECT student_id, score FROM student ORDER BY score DESC
''')
ranked_students = cursor.fetchall()
current_date = datetime.now()
for rank, (student_id, score) in enumerate(ranked_students, start=1):
    graduation_date = current_date + timedelta(days=rank)
    cursor.execute('''
    UPDATE student
    SET graduation_date = ?
    WHERE student_id = ?
    ''', (graduation_date, student_id))
conn.commit()
cursor.execute('SELECT student_id, name, score, graduation_date FROM student')
print("Danh sách sinh viên và thời gian tốt nghiệp:")
for row in cursor.fetchall():
    print(row)
conn.close()

Danh sách sinh viên và thời gian tốt nghiệp:
(1, 'Nguyen Minh Hoang', 6.7, '2025-03-19 22:38:13.564188')
(2, 'Tran Thi Lan', 9.2, '2025-03-14 22:38:13.564188')
(3, 'Pham Van Nam', 7.9, '2025-03-16 22:38:13.564188')
(7, 'Bui Tien Dung', 9.2, '2025-03-15 22:38:13.564188')
(9, 'Duong Huu Phuc', 7.2, '2025-03-17 22:38:13.564188')
(10, 'Cao Thi Hanh', 7, '2025-03-18 22:38:13.564188')

C:\Users\DELL\AppData\Local\Temp\ipykernel_12624\2185000986.py:11: DeprecationWarning: The default datetime adapter is deprecated as of Python 3.12; see the sqlite3 documentation for suggested replacement recipes
  cursor.execute('''